Revit 2015 API
CameraInfo Properties
The CameraInfo type exposes the following members.
Properties
Name | Description
FarDistance
 Distance from eye point to far plane of view frustum along the view direction.
HorizontalExtent
 Distance between left and right planes on the target plane.
IsPespective
 Identifies whether the projection is orthographic or pespective
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
NearDistance
 Distance from eye point to near plane of view frustum along the view direction.
RightOffset
 Distance that the target plane is offset towards the right where right is normal to both Up direction and View direction. This offset shifts both left and right planes.
TargetDistance
 Distance from eye point along view direction to target plane.
UpOffset
 Distance that the target plane is offset in the direction of the Up direction. This offset shifts both top and bottom planes.
VerticalExtent
 Distance between top and bottom planes on the target plane.
See Also
CameraInfo Class
Autodesk.Revit.DB Namespace